[Killed] StringLiteral
Trybe/exercise-digimon-finders/src/App.js:9:22
   constructor() {
     super();
     this.state = { 
-      searchDigimon: '', 
+      searchDigimon: "Stryker was here!", 
       isFetching: false, 
       errorMessage: '' 

[Killed] BooleanLiteral
Trybe/exercise-digimon-finders/src/App.js:10:19
     super();
     this.state = { 
       searchDigimon: '', 
-      isFetching: false, 
+      isFetching: true, 
       errorMessage: '' 
     };

[Killed] BlockStatement
Trybe/exercise-digimon-finders/src/App.js:24:24
 
   requestDigimon = async () => {
     const { searchDigimon } = this.state;
-    if (searchDigimon) {
-      fetch(`https://digimon-api.vercel.app/api/digimon/name/${searchDigimon}`)
-        .then((res) => res.json())
-        .then((results) => this.setState((state) => ({
-          ...state,
-          digimon: results[0],
-          errorMessage: results["ErrorMsg"],
-          isFetching: true,
-        })));
-    }
+    if (searchDigimon) {}
   }
 
